
import { ct } from "./types"

export const CosRad = Math.cos(-Math.PI/4);// 逆时针旋转 45° 的角度，即-45 * Math.PI / 180
export const SinRad = Math.sin(-Math.PI/4);
export const CosRad1 = Math.cos(Math.PI/4);// 顺时针旋转 45° 的角度
export const SinRad1 = Math.sin(Math.PI/4);
export const BagFullInfo= '背包已满'
export const LineIsFullInfo = '目标地图线路已爆满'
export const NotEnoughLineTimeInfo = '进入地图线路的权限已过期'
export const TooManyRedPointInfo = '红名状态无法切换地图、使用回城、随机卷轴'
export const GrowthProNames:Array<string>=['防御成长值','生命成长值','攻击成长值','元素攻击力成长值','元素防御力成长值']
export const NoTargetAtNeiborStr = '附近暂无目标'
export const ZmJobStr = ['成员','精英','副盟主','盟主']
export const ZmJobColor = [ct.white,ct.blue,ct.green,ct.yellow]
export const PriceTypeStr = ['','金币','钻石','点数','跨服积分','战盟贡献']
export const PKModeStr = ['和平','队伍','战盟','联盟','全体']
export const SkillModeStr = ['挂机','Boss','竞技']
export const LianMaxLvStr = '炼体等级无法超过角色等级'
export const UnlistedStr = '已下架';
export const HoleOpenNumOverInfo = '当前矿洞剩余打开次数已用完，请换一个'
export const ItemTypeStr = '全部类型,宝石,技能书,材料,货币,箱子,其它';
export const EquipTypeStr = '全部类型,头盔,铠甲,护腿,护手,鞋子,戒指,项链,武器,盾牌,箭筒,召唤的书,宝珠,翅膀,宠物,勋章,坐骑,恶魔,天使';
export const FbMaterialInfoStr = '用于合成副本入场券的材料';
export const TuoGuanStr = `<color=#0f0>临时在线托管中...</color><br/><color=#C3C3C3>(高效且不费流量，与退出游戏后的离线托管一致)<br/><color=#C3C3C3>(已开通特权卡的玩家可关闭游戏,自动进入离线托管)</color><br/></color>`
export const BaoBaoInfoStr= '协助战斗，技能等级越高，召唤兽越强（召唤兽使用技能时将消耗主人的魔法值、技能值）'
export const ResetSkillStr= `<color=${ct.gray}>(转换角色职业类型时会自动执行重置所有技能)</><br/><br/>`
export const ResetSkillInfoStr = `<size=26><color=${ct.brown}>重置技能将返还所有已消耗道具</></size><br/><br/>`
export const FuMoInfo0='附魔有概率新增一条属性\n原属性越多，成功新增的概率越低，最多4条属性'
export const FuMoInfo1='每一条属性都需要单独升级\n等级越高概率越低，阶段为0~4、4~7、7~10'
export const FuMoInfo2='重置后将随机重置所有属性，属性不可重复\n被锁定的属性不会被重置';
export const AdvanceRoleTypeLvInfo = '果然没令我失望，如果你的等级达到要求，就可以进行职业进阶了，当然，手续费还是必须要的，这是城主的命令！'
export const ZhuanShengInfo = '不走寻常路，才能收获别样的风景！只要你带足金币，我就能让你收获不一样的人生！'
export const RedBossDropItems=`<color=${ct.gray}>怪物的脚趾、怪物的骨头、怪物的心脏、玛雅,祝福,灵魂<br/>生命,创造,再生原石,守护宝石,幸运宝石</><br/>`
export const WorldBossDropItems=`<color=${ct.gray}>怪物的脚趾、怪物的骨头、怪物的心脏<br/>玛雅,祝福,灵魂,生命,创造,再生原石<br/>守护宝石,幸运宝石,套装石</><br/>`
export const WorldBossDropItemsLv100=`<color=${ct.gray}>怪物的脚趾、怪物的骨头、怪物的心脏<br/>玛雅,祝福,灵魂,生命,创造,再生原石<br/>守护宝石,套装石,玄铁镐,乌金镐,钻石镐<br/>幸运宝石,炎狼号角,元神愤怒碎片,元神守护碎片</><br/>`
export const CallRedOrMyBossDropInfo=`<color=${ct.white}>2.击杀后掉落3件物品:<br/></><color=${ct.gray}>8%概率为道具<br/>50%概率为金币<br/>42%概率为装备 <br/>`
export const WorldBossDropInfo=`<color=${ct.white}>2.击杀后掉落5件物品:<br/></><color=${ct.gray}>8%概率为道具<br/>30%概率为金币<br/>62%概率为装备 (装备有10%概率为<color=${ct.green}>卓越装备</>)<br/><br/></>`
export const OwnerInfo=`<color=${ct.gray}>(掉落归属于召唤者，附近队伍成员共享经验与击杀数)</><br/><br/>`
export const MyBossOwnerInfo=`<color=${ct.gray}>掉落归属于召唤者<br/>召唤击杀时附近队伍成员共享经验与击杀数<br/>扫荡时独享经验，附近队伍成员共享击杀数</><br/><br/>`
export const CallOkInfo='召唤成功！就刷新在你旁边，赶快去击杀吧！'
export const Fb_em_info=`恶魔广场8:00~23:00之间每逢<color=${ct.yellow}>整点开放</><br/>0-5分为<color=${ct.green}>进场</>准备时间，5分开始刷怪，持续15分钟<br/>进入、扫荡均需<color=${ct.yellow}>门票</>`
export const Fb_xs_info=`血色城堡8:00~23:00之间每逢<color=${ct.yellow}>整点开放</><br/>30-35分为<color=${ct.green}>进场</>准备时间，35分开始刷怪，持续15分钟<br/>进入、扫荡均需<color=${ct.yellow}>门票</>`
export const QhOrZyAddBuffInfo=`【<color=${ct.blue}>攻击套强化加成</>】：<color=${ct.red}>最大攻击力提升+n%</>
当主手、副手、项链、2个戒指的强化等级都>=9时激活，强化9~15最大攻击力分别提升1、2、3、4、5、6、8%<br/><br/>
【<color=${ct.blue}>强化加成</>】：
当头、铠、腿、手、鞋为同一套装备时：
  • 1.<color=${ct.blue}>防御率</>+整套防具总防御力/10
  • 2.当整套防具都强化等级>9时，<color=${ct.blue}>防御力</>+整套防具总防御力x(最低强化等级-9)x5%<br/>
【<color=${ct.green}>卓越属性条数加成</>】：<color=${ct.brown}>伤害提升+n%</>
  • 1.1代2代翅膀的每一条卓越属性都计算，每条+1%
  • 2.3代翅膀的每一条卓越属性都计算，每条+2%
  • 3.其它装备从第2条卓越属性开始计算，每多1条+0.5%`
export const enum ItemFramePath{
    Gray = 'item_gray',
    Blue = 'item_blue',
    Green = 'item_green',
    Red = 'item_red',
    Purple = 'item_purple',
    Yellow = 'item_yellow',
}
export const QuestHelpStr=
`<color=${ct.yellow}>【日常任务】：</>任务数量、任务奖励会随着角色等级提升而变多。<br/>
<color=${ct.yellow}>【成就任务】：</>成就任务为一次性达成任务，达成后可领取丰厚奖励(黄金卡有效期内，钻石奖励翻倍)<br/>
<color=${ct.yellow}>【委托任务】：</>委托任务每10次为一轮，每日0点增加10次，可累积，不必每天做，最高可累积至100次。
       <color=${ct.blue}>【任务奖励】：</>完成每一次任务都有奖励，每一轮结束时会有额外随机奖励，等级越高，奖励越好(黄金卡有专属额外奖励)
       <color=${ct.blue}>【任务规则】：</>任务无法放弃和更换，必须完成本次任务才能进行下一次任务。
       <color=${ct.blue}>【难度级别】：</>高级别任务与低级别任务难度区别不大，但奖励道具池更多
              Lv0：100~219级
              Lv1：220~319级
              Lv2：320~400级
              Lv3：1转~5转
              Lv4：5转~10转
              Lv5：10转以上<br/>`
//<color=${ct.yellow}>【Npc事件】：</>分布在奇迹大陆的各个Npc在需要帮助时会发布求助事件，所有玩家共享，任务需求数量有限，当需求达标后，该事件完成并删除。每个玩家只能完成提交1次需求。

export const TeamActStr0 = `<color=${ct.qing}>集合</>：把对方拉到我身边<br/><color=${ct.green}>归位</>：通知对方【<color=${ct.white}>返回</>】上次保存的挂机点<br/>解散：通知对方【<color=${ct.white}>返回</>】旧坐标`
export const TeamActStr1 = `<color=${ct.gray}>转让BOSS</>：把我召唤的BOSS转让给附近的队友\n让他承受BOSS的攻击，归属将属于队友`
export const KdHelp = `<color=${ct.blue}>【玩法介绍】</>矿洞分为金矿、钻石矿、宝石矿，均可用对应的镐子升级，满级10级；矿洞每小时产出，玩家每天只能收取库存1次（黄金卡+3次），超过24小时未收取将停止产出。<br/>
<color=${ct.blue}>【掠夺矿洞】：跨服匹配，不看实力，只看运气！匹配范围从0级到自身矿洞平均等级+3级（黄金卡+2级）(除了玩家矿洞，还存在大量0级到10级的系统矿洞)</>
       每天有5次掠夺机会（黄金卡+5次）；每次掠夺时，只有5次开格子机会（黄金卡+10次）；开到存储格子时，即可获得该格子存放物资一定比例的库存（10%+自身增加掠夺比例-对方减少被掠夺比例)；<br/>
<color=${ct.blue}>【占领富矿】</>：富矿分为本服富矿(需220级)、跨服富矿(需1转0级)，每种富矿每日可抢占5次（黄金卡各+5次）。
       发起抢占时，扣除所有队员1次抢占次数，若有队员次数不足则无法抢占；抢占时仅非离线状态的队员才能参加战斗(防守时也一样)，在1分钟之内击败所有敌人则抢占成功，否则失败；
       队长可在队伍设置界面设置战斗阵型；抢占战斗属于竞技系统，战斗过程全自动，且无法使用血瓶、蓝瓶，但自动恢复型属性依然有效；竞技系统独立于普通挂机地图的战斗，战斗过程不影响原地图的战斗；
       抢占成功后全体队友将获得对应富矿加成，本服富矿和跨服富矿可同时占领，加成效果可叠加；
       刚加入队伍的队员可立即获得队伍的富矿加成；有队员退出队伍时，整个队伍都将失去所有富矿；所有队员都处于离线状态时也将失去所有富矿；`
export const CanPianRlInfo = `<br/><color=${ct.gray}>60%概率获得金币<br/>30%概率获得钻石<br/>9%概率获得随机宝石(玛雅、祝福、灵魂)<br/>1%概率获得附魔宝石</><br/>`
export const KfJfRandomInfo = `<br/><color=${ct.gray}>40%概率获得：<br/>黄金宝箱+9<br/><br/>30%概率获得：<br/>萤石<br/><br/>16%概率获得：<br/>天钢石<br/><br/>10%概率获得：<br/>随机宠物、羽毛、国王、萤石、深渊之羽、2代翅膀转换符、首饰转换符<br/><br/>3%概率获得：<br/>卓越防御符<br/><br/>1%概率获得：<br/>3代翅膀转换符、380武器转换符、400武器转换符</><br/>`
export const HuiKuiBox = `<br/><color=${ct.gray}>60%概率获得：许愿币x2<br/>30%概率获得：许愿币x5<br/>10%概率获得：魂兽碎片x100</><br/><br/>(魂兽碎片为非实体不可交易道具，请让主力角色开宝箱)`
export const DaTianShiBox = `<br/><color=${ct.gray}>50%概率获得：许愿币x5<br/>30%概率获得：生命宝石、创造宝石、再生宝石<br/>11%概率获得：元素愤怒碎片、元神守护碎片<br/>6%概率获得：大天使防具碎片<br/>3%概率获得：大天使武器碎片</><br/>`
export const ShenQiBox = `<br/><color=${ct.gray}>50%概率获得：许愿币x5<br/>40%概率获得：生命宝石、创造宝石、再生宝石<br/>10%概率获得：神器碎片</><br/>`
export const ChengZhuBox = `<br/><color=${ct.gray}>10%概率：380或400卓越武器1件<br/>15%概率：深渊之羽x10<br/>15%概率：神鹰火种x1<br/>30%概率：1万钻石<br/>30%概率：10亿金币</><br/>`
export const HoleItemRandomInfo = `<br/><color=${ct.gray}>60%概率获得玛雅宝石<br/>25%概率获得怪物的脚趾、骨头、心脏、祝福、灵魂<br/>10%概率获得生命、创造、再生原石、守护宝石<br/>4%概率获得玄铁镐、乌金镐、钻石镐<br/>1%概率获得幸运宝石、套装石</><br/>`
export const TowerItemInfo = `<br/><color=${ct.gray}>概率分布：<br/>玛雅宝石46%、祝福宝石25%、灵魂宝石15%<br/>生命宝石4%、创造宝石4%、再生宝石2%、守护宝石4%<br/>`
// export const TgYkInfo=`<br/>【托管卡】是最基础的功能卡，有效期内享有以下必备特权：<br/>1.24小时自动<color=${ct.green}>离线托管</><br/>2.全屏<color=${ct.green}>自动拾取</>道具<br/>3.<color=${ct.green}>远程NPC</>访问权限<br/>`
export const BaseYkInfo=`<br/>【特权卡】当前角色享有以下特权：<br/>1.交易市场<color=${ct.green}>交易权限</><br/>2.<color=${ct.green}>所有已开通特权卡角色之间，可互相共享使用仓库（即可通过仓库在角色之间转移道具、金币、钻石、点数，免手续费）</><br/>3.如有<color=${ct.purple}>专属线路</>则可进入<br/>4.在<color=${ct.green}>野外</>也可获得泡点经验<br/>5.角色被怪物杀死5秒后<color=${ct.green}>原地复活</><br/>6.最大离线托管时长从2小时延长至26小时<br/>7.当线路满时，不会被挤回城<br/><br/><color=${ct.green}>本游戏没有任何绑定道具，小怪也能爆极品卓越、各种宝石（装备、宝石的怪物掉落等级与端游基本一致）<br/><br/>世界BOSS、个人BOSS可爆一切，不存在白嫖、微氪因抢不到BOSS而无法打到好东西的情况</>`
export const BaseYkInfoYkMode=`<br/>【特权卡】当前角色享有以下特权：<br/>1.特权卡角色之间可<color=${ct.green}>面对面交易</><br/>2.可离线托管挂机(最长26小时)、可自动回收<br/>3.<color=${ct.green}>所有已开通特权卡角色之间，可互相共享使用仓库（即可通过仓库在角色之间转移道具、金币、钻石、点数，免手续费）</><br/>4.背包容量+25，仓库容量+15，道具市场容量+15<br/>5.在<color=${ct.green}>野外</>也可获得泡点经验<br/>6.角色被怪物杀死5秒后<color=${ct.green}>原地复活</><br/>7.可参与师徒、矿洞、许愿、活动抽奖<br/>8.可使用礼包码、绑定推广码、领取成就奖励<br/>9.每日、委托任务有概率获得钻石奖励<br/>10.当线路满时，不会被挤回城<br/><br/><color=${ct.green}>本游戏没有任何绑定道具，小怪也能爆极品卓越、各种宝石（装备、宝石的怪物掉落等级与端游基本一致）<br/><br/>世界BOSS、个人BOSS可爆一切，不存在白嫖、微氪因抢不到BOSS而无法打到好东西的情况</>`
export const GoldYkInfo=`<br/>【黄金卡】当前角色享有以下特权：<br/><color=${ct.brown}>1.<color=${ct.green}>瞬间直达</>免费,立即<color=${ct.green}>原地复活</>免费,可进入<color=${ct.yellow}>黄金线路</><br/>2.<color=${ct.green}>召唤队友免钻石</>；击杀怪物<color=${ct.yellow}>获得金币提升100%</><br/>3.矿洞<color=${ct.red}>产量提升50%</>，每日<color=${ct.green}>收取次数+3、掠夺次数+5、抢占次数+5、每次掠夺开格子次数+10、免费一键匹配高级矿且为钻石最多的矿，并自动掠夺、一键开完格子、无视陷阱、矿洞匹配范围上限+2级</><br/>4.完成每轮委托任务后可获得<color=${ct.green}>额外专属奖励</><br/>5.分解道具获得金币、钻石、装备残片数量<color=${ct.green}>翻倍</><br/>6.击杀普通怪物增加的<color=${ct.green}>击杀数翻倍</><br/>7.杀怪、任务、泡点获得<color=${ct.green}>经验值提升+20%</><br/>8.可<color=${ct.green}>一键扫荡</>所有个人Boss，且所有个人Boss每日<color=${ct.green}>次数+1</>，每日<color=${ct.green}>普通许愿次数+2</><br/>9.主线/每日/委托任务获得<color=${ct.green}>3倍</>数量的金币/经验/钻石<color=${ct.green}></><br/>10.每日任务、委托任务的单次随机奖励概率分布变成(<color=${ct.green}>25%，25%，25%，25%</>)<br/>11.可<color=${ct.green}>一键完成</>所有每日任务；可<color=${ct.green}>一键击杀</>悬赏BOSS、<color=${ct.green}>一键搜魂</>；<color=${ct.green}>在跨服地图挂机时长无限制</>（无黄金卡时每日只有4小时）<br/>`
export const PrivateLineKaInfo=`<color=${ct.purple}>【专属线路】：</><color=${ct.brown}>怪物4秒复活</>，隐藏线路，购买专属线路卡后可见。<br/>          1.您在本服内只需一个角色开通专属线路，该服下您的所有角色均可加入专属线路（前提是该角色的特权卡在有效期内）。<br/>          2.个人独享的线路，且每个地图都有该专属线路，包括副本，不同角色可分别进入不同地图的专属线路，也可进入同一地图线路组队挂机。<br/>          3.只有自己的号才能进入专属线路，<color=${ct.brown}>独享最佳刷怪点、副本、野外BOSS、世界BOSS、NPC事件等</>。<br/>          4.专属线路的怪物、BOSS都<color=${ct.brown}>没有最大掉落等级限制，所有角色可自动互相帮忙击杀悬赏BOSS、个人BOSS</><br/>          5.可<color=${ct.green}>一键击杀</>该线路的所有野外BOSS、世界BOSS(已首杀过的)，大量节省时间<br/>          6.购买后，将立即启动专属线路，并复活该线路所有世界BOSS<br/>          7.跨服地图内击杀怪物获得<color=${ct.green}>跨服积分提升50%</><br/>`
export const CkHelpStr=
`<color=${ct.blue}>【基本功能】：</>相同账号且相同服务器下的所有特权卡有效期内的角色之间，可共享使用仓库，无手续费，任何道具、货币都可放入仓库(药水除外)；<br/>
<color=${ct.yellow}>【使用规则1】：</>特权卡有效期内的角色仓库才可被共享使用；<br/>
<color=${ct.yellow}>【使用规则2】：</>7天内有登录过的角色才能被看到，如果看不到，请登录一下该角色；<br/>
<color=${ct.yellow}>【使用规则3】：</>每个角色有独立的仓库，有限数量的装备栏、无限数量的道具栏；<br/>
<color=${ct.yellow}>【使用规则4】：</>角色被转让后，该角色的仓库将跟随角色一起被转让；`

export const BossHelpStr = 
`<color=${ct.yellow}>【悬赏Boss】</><br/>       每击杀1只普通怪物，击杀数+1(黄金卡有效期内翻倍)，每种野外普通怪物独立统计个人击杀数量（只显示当前地图怪物数据），达到指定数量即可召唤同名Boss来击杀。召唤的黄金Boss、精英Boss会出现在玩家附近，掉落归属于个人，附近队伍成员共享经验。<br/>
<color=${ct.yellow}>【野外Boss】</><br/>       野外BOSS刷新逻辑：每个地图线路独立统计当前线路每个角色的击杀数，每6000击杀数(普通线路7200击杀数)随机刷1只BOSS，其中90%概率为黄金BOSS、10%概率为精英BOSS；若该地图线路剩余野外BOSS数量>=5只时，则暂时不刷新，继续累计击杀数；当剩余BOSS被击杀后，若击杀数足够则立即刷新新的BOSS；掉落归属于对Boss总伤害最高的玩家。<br/>
<color=${ct.yellow}>【个人Boss】</><br/>       每只个人BOSS每日可召唤击杀1次（黄金卡+1次），每日0点重置次数（黄金卡可一键扫荡所有已首次击杀过的个人Boss），召唤、扫荡个人Boss时会自动进行搜魂，有概率获得魂兽<br/>
<color=${ct.yellow}>【世界Boss】</><br/>       所有世界BOSS在每日10点、20点各复活一次；世界BOSS死亡后会在原地生成一个该Boss的亡魂，每个玩家可对该亡魂进行搜魂，有概率获得魂兽（需要达到可击杀等级才能对该亡魂进行搜魂）<br/>
<color=${ct.yellow}>【跨服Boss】</>需要等级>=400级<br/>       所有跨服BOSS在每日21点复活`

export const VersionInfoYk=
`游戏特色：竖屏放置，自由交易，一键托管，无需云手机！<br/>
【<color=${ct.green}>搬砖版</>】设置：真正零氪可搬砖的版本
1.<color=${ct.blue}>无累计充值奖励，无任何绑定道具，商城不卖任何宝石、装备</>，回归奇迹1.03H经典设置，一切全靠打怪或合成！给予市场最大自由度！永不合服，支持跨服交易；
2.<color=${ct.blue}>零氪白嫖也可自由交易+自动捡东西+在线托管挂机</>，可在道具交易行买卖道具、可在宝石市场买卖宝石、可在钻石交易行兑换点数，有了点数就可以开通永久特权卡、黄金卡，解放双手！
3.<color=${ct.blue}>黄金卡可面对面交易！</>
4.<color=${ct.blue}>所有人爆率都一样</>，就看谁杀的快、杀的多！
5.<color=${ct.blue}>红名死亡不掉装备</>，可安心打造！但红名有惩罚！
6.激活永久特权卡后可离线托管挂机、自动回收、可参与所有玩法，搬砖更轻松
7.每个账号在同一个服下只能免费创建一个角色，后续创建需要当前所有角色都已激活永久特权卡，第5个后需要50点/个创建费`
export const VersionInfo=
`游戏特色：竖屏放置，自由交易，一键托管，无需云手机！<br/>
【<color=${ct.yellow}>爽玩版</>】设置：
1.交易+托管需要特权卡(30点/年)，黄金月卡30点/年(开交易后，点数可通过钻石兑换获得)
2.<color=${ct.blue}>有累计充值奖励</>，商城不卖任何装备和宝石
3.游戏产出钻石数量较多，特殊装备的属性比较强，<color=${ct.blue}>玩起来比较爽</>！`
export const KfMapInfo = 
`【跨服地图】：<color=${ct.red}>远古战场、神之秘境</>
  • 跨服地图只有1条线路，无黄金线路、专属线路，不刷野外BOSS（但有悬赏BOSS）
  • 每日可免费进入4小时，黄金卡无限制，有专属线路则所有角色击杀怪物获得跨服积分提升50%
  • 跨服地图内，PK不红名，无法保存挂机点，无法跨服组队，无法查看摊位，被玩家击杀不掉经验，被怪物击杀原地复活
  • 跨服内被玩家击杀，则损失5%积分(最多500积分)，如果被杀角色有特权卡，则对方可获得该积分的50%
  • 剩余时间不足、被玩家击杀时，执行归位，全队返回本服挂机点；
  • 在跨服地图击杀怪物、BOSS可获得跨服积分（队伍所有成员都加），跨服积分可在跨服积分商店兑换道具
  • 跨服怪物特殊掉落：仙兽晶核、恶魔精血、天使之泪、炎狼号角、套装石
  • 跨服BOSS掉落：比本服高级世界BOSS多了天钢石`

export const LineHelpStr=
`<color=${ct.white}>【普通线路】：</>怪物6秒复活，默认线路，可免费进入<br/>
<color=${ct.yellow}>【黄金线路】：</>怪物5秒复活，黄金卡有效期内可进入。怪物不会随玩家等级提升而变灰不掉落<br/><br/>`

export const MarketHelpStr=
`交易行手续费率为(本服10%、跨服15%)；在交易行购买道具之前，需要先存入足够钻石到摊位，成交时消耗的是摊位内的库存钻石；<br/>
<color=${ct.yellow}>【竞购】：</>竞购到期时，随机选择一名竞购者进行成交，并原价退回钻石给其它竞购者。竞购成功的道具将放入摊位的临时仓库；<br/>
<color=${ct.red}>【加价】：</>您参与过竞购的道具，若有其他人也参与了竞购，则此时可加价（每次加价需补差价=现价的10%），加价后，您将暂时成为新价格的唯一竞购者；<br/>
<color=${ct.yellow}>【购买】：</>当道具竞购期结束时，若无人竞购，则进入自由购买阶段，此时购买可直接成交，无需等待；<br/>
<color=${ct.red}>【强制下架手续费】：</>竞购期间下架道具，若有人竞购，则此时强制下架需要扣除当前价10%手续费（钻石不足也要扣，钻石为负数时，将无法上架道具，需要存入足够钻石才能变为正数）；`

export const yhDhInfoStr=
`【<color=${ct.white}>白色樱花树枝</>】：20%概率出宝石(玛雅、祝福、灵魂、生命)，80%概率出+4黄金宝箱装备，不出卓越，强化0-5<br/>
【<color=${ct.red}>红色樱花树枝</>】：20%概率出宝石(玛雅、祝福、灵魂、生命)，80%概率出+4黄金宝箱装备，出装备时5%概率卓越<br/>
【<color=${ct.yellow}>黄色樱花树枝</>】：20%概率出宝石(玛雅、祝福、灵魂、生命)，20%概率出樱花仙子宠物，60%概率出+6黄金宝箱装备，出装备时10%概率卓越<br/>
【<color=${ct.yellow}>南瓜花蕾</>】：20%概率出宝石(玛雅、祝福、灵魂、生命)，20%概率出南瓜仙子宠物，60%概率出+6黄金宝箱装备，出装备时10%概率卓越`

export const xuYuanNormalInfo=
`每天可免费许愿1次
<color=${ct.blue}>奖池</>：每次许愿，都会往奖池选票箱中增加一张个人选票，且奖池<color=${ct.qing}>钻石+5</>
<color=${ct.blue}>幸运儿大奖</>：每日0点开奖，从选票箱中随机选3名(不重复)，一等奖1名，奖励奖池中的所有钻石；二等奖1名，奖励许愿币x10；三等奖1名，奖励许愿币x5
<color=${ct.blue}>每次许愿随机奖励：</>
       金币：<color=${ct.brown}>约65%</>
       钻石：<color=${ct.brown}>约20%</>
       玛雅、祝福、灵魂：<color=${ct.brown}>约10%</>
       技能书页、生命宝石、创造宝石、再生宝石：<color=${ct.brown}>约3%</>
       卓越属性重置符：<color=${ct.brown}>约0.3%</>
       卓越首饰：<color=${ct.brown}>约1.5%</>
       樱花仙子、南瓜仙子：<color=${ct.brown}>约0.2%</>`

export const xuYuanAdvanceInfo=
`<color=${ct.blue}>奖池</>：每次许愿，都会往奖池选票箱中增加一张个人选票，且奖池<color=${ct.qing}>钻石+20，所有玩家共享概率</>
<color=${ct.blue}>幸运儿大奖</>：每日0点开奖，从选票箱中随机选3名(不重复)，一等奖1名，奖励奖池中的所有钻石；二等奖1名，奖励许愿币x20；三等奖1名，奖励许愿币x10
<color=${ct.blue}>每次许愿随机奖励：</>
    金币：<color=${ct.brown}>约80%</>
    魂兽碎片：<color=${ct.brown}>约6%</>
    技能书页：<color=${ct.brown}>约4%</>
    矿镐、仙兽晶核、勋章碎片、恶魔精血、天使之泪：<color=${ct.brown}>约5%</>
    套装石、幸运宝石、炎狼号角、卓越属性重置符：<color=${ct.brown}>约2%</>
    卓越首饰：<color=${ct.brown}>约2%</>
    樱花仙子、南瓜仙子：<color=${ct.brown}>约1%</>`
export const hunHelpInfo=
`【<color=${ct.purple}>魂兽系统</>】：
一、【搜魂】
    1.世界boss被击杀后，会在原地生成一个亡魂，每个人均可对该亡魂进行搜魂，有概率获得魂兽（黄金卡可一键搜魂，无需前往）
    2.个人BOSS在召唤、扫荡时也有概率获得魂兽；
二、【附体】每种魂兽的基础属性值各不相同，但只能同时附体一只魂兽，附体后该魂兽的属性将临时附加到当前角色身上；
三、【升星】5只同类型同星级的魂兽可升星，升星后属性值翻倍；
四、【分解】分解魂兽可获得魂兽碎片，越高级、星级越高的魂兽，分解获得的碎片越多；
五、【合成】魂兽碎片可用于重新合成随机魂兽，每次需要20个碎片；`
export const payInfo=
`【说明】：
一.<color=#FF6600>【点数】：</>可用于给指定角色购买游戏特权卡、月卡等，也可在交易行与其它玩家兑换钻石；
二.<color=#B3FF77>【积分】：</>搬砖版无累计充值奖励，充值不送积分；爽玩版可用于在<color=#FF6600>福利</>界面领取<color=#FF6600>累充奖励</>；
三.<u><color=#ffff00 click="onClick" param="i777">【回馈宝箱】</></u>：充值<color=#FF6600>每满100元</>额外奖励1个；
四.充值后，<color=#FF6600>点数、积分、回馈宝箱</>发放到您的账号上，需要前往“<color=#FF6600>功能</>”=>“<color=#FF6600>转入点数</>”、“<color=#FF6600>转入积分</>”、“<color=#FF6600>领取回馈宝箱</>”到当前角色后，才能使用。
五.本游戏只有<color=#FF6600>点数</>充值，明明白白消费，无<color=#f0a>充值陷阱</>，且点数可在<color=#FFff00>本区内全服通用</>，哪个角色需要时转入即可，点数可在<color=#00ff00>钻石交易行</>交易（即可用游戏内获得的<color=#00E0FF>钻石</>来换取点数）`
export const rankPkInfo=`挑战时随机匹配积分排名相近的队伍，成功击败敌人才算胜利
2.挑战胜利：积分+5+连胜分(敌方积分-1，连胜归0)
（连胜3次+1分、连胜5次+2分、连胜10次+5分）
3.挑战失败：积分+1，连胜记录归零
4.竞技场内自动使用竞技模式技能组，请提前配置技能
5.注意：竞技场以队伍为单位，且为固定队伍成员模式，若队伍成员发生变动，则将清空本队伍在当前赛季的积分、排名`
export const HuoDongInfo=`【<color=${ct.red}>火龙王袭击</>】：
  • 每天早上9、11、13、15、17、19、21、23整点时在勇者大陆、仙踪林刷新，普通线路1刷新2只、黄金线路第1条线路随机刷新3只
  • 火龙王掉落无归属，需手动拾取：<color=${ct.yellow}>金币、钻石、许愿币x1、随机宝石x1(20%概率)</>
  • 随机宝石可能为：<color=${ct.yellow}>玛雅、祝福、灵魂</>，还有较低概率为<color=${ct.yellow}>生命宝石、创造宝石</>
  • 火龙王会随开服天数逐渐增强，直到满60天后不再增强<br/><br/>`
export const TowerInfo=`【<color=${ct.red}>无尽之塔</>】：
  • 单角色独立挑战模式(<color=${ct.blue}>使用BOSS技能组</>)，每周一个赛季，每周日晚上0点以邮件的形式发放奖励
  • 注意：每个赛季每件装备只能被同一个角色使用一次
  • 首次通关奖励：<color=${ct.qing}>钻石</>x2x层数
  • 赛季奖励：<color=${ct.yellow}>宝石碎片</>xN（层数越高数量越多）
  • 每次赛季开始时，需从0层开始挑战（黄金卡则可从上个赛季最高层-10层处开始挑战）
  • 每个阶段10层，每层BOSS属性递增，需在1分钟内击杀BOSS才算过关
  • BOSS的生命值不高，但元素防御较高，只有基础实力强大的勇士才能击败高层BOSS`
export const GcHelpInfo=`【<color=${ct.red}>跨服攻城</>】：
1.周一、周二为<color=${ct.blue}>报名阶段</>，至少3个不同服战盟报名才能开启，最多40个战盟；
2.周三、周四为<color=${ct.blue}>准备阶段</>，盟主可用战盟金币提升据点护盾星级；
3.周五为<color=${ct.blue}>选择据点阶段</>，初始据点位置随机分配，盟主可手动切换据点；
4.周六、周日为<color=${ct.blue}>进攻阶段</>：
  a.每个角色每天可参与挑战3个不同据点，每个据点每天可免费挑战3次；可挑战与自身战盟据点相邻的据点；
  b.攻城BOSS被击杀后，据点归属于最后击杀者所属战盟，但掉落归属与总伤害最高的战盟；最后击杀BOSS的角色将自动成为据点的驻守者，且每个角色只能同时驻守1个据点，盟主可手动更换驻守者；
  c.攻城BOSS掉落道具与跨服战盟BOSS掉落一致，具体掉落道具跟BOSS等级有关（中间最强BOSS额外掉落1个城主宝箱），除了道具，战盟可获得贡献，个人也可获得贡献和钻石，积分越高的据点奖励数量越多，按伤害百分比分配；
  d.每个据点都有积分，攻城结束时，按每个战盟所占领据点的总积分排名来结算奖励；
  e.挑战其它玩家时，与跨服竞技类似，有隐藏的开服天数差距buff；
5.周一早上0点<color=${ct.blue}>结算</>，按最终占领据点总积分排名(积分为0不参与排名)，所有参与战盟奖励战盟点数=总积分/10，前10名战盟排行奖励：
  第1名：大厅效果提升(50+总积分/10)%，<u><color=${ct.red} click="onClick" param="b88">城主宝箱x10</></u>
  第2名：大厅效果提升(35+总积分/10)%，<u><color=${ct.yellow} click="onClick" param="b72">城主宝箱x5</></u>
  第3名：大厅效果提升(25+总积分/10)%，<u><color=${ct.yellow} click="onClick" param="b71">城主宝箱x3</></u>
  第4名：大厅效果提升(15+总积分/10)%，<u><color=${ct.yellow} click="onClick" param="b71">城主宝箱x2</></u>
  第5名：大厅效果提升(10+总积分/10)%，<u><color=${ct.yellow} click="onClick" param="b71">城主宝箱x1</></u>
  第6~10名：大厅效果提升(5+总积分/10)%`
  export const KfBuffInfo=`【跨服PVP与开服天数差距规则】<br/>
  1.开服天数满60天后，且等级满320级的所有角色可参与跨服玩法；等级满380级的角色则不受开服天数限制，可提前跨服；<br/>
  2.同大区内，开服天数差距buff加成具体数值与规则：
    1.在跨服地图中PK时，如果我的服晚于他的服，且我的服少于150天，则我受到他的所有伤害将减少=(开服天数差额/4)%（上限90%）<br/>
    2.在跨服竞技中(跨服竞技场、跨服矿抢占、跨服攻城挑战)，有隐藏的开服天数差距buff；假如开服天数差为n，则在开服60+n天内，晚开服的玩家与对方PK时，受到伤害减少n/2%(上限90%)，伤害提升n/2%，受到反伤减少+n，元素攻击力+n，元素防御力+n/2;`
// export const rankPkRewards=`【本服竞技奖励】：
// 一、【每日排名奖励】：每日0点根据积分排名，前50名才有奖励，除了排名奖励，还额外奖励等额积分的钻石(黄金卡有效期内钻石奖励翻倍)
//     • 第1名：大天使宝箱x3
//     • 第2名：大天使宝箱x2
//     • 第3名：大天使宝箱x1
//     • 第4名：许愿币x6
//     • 第5名：许愿币x5
//     • 第6~10名：许愿币x4
//     • 第11~20名：许愿币x3
//     • 第21~50名：许愿币x2
// 二、【赛季额外奖励】：根据上个赛季结束时的积分排名，前50名才有奖励
//     • 第1名：自选宠物x5
//     • 第2名：自选宠物x4
//     • 第3名：自选宠物x3
//     • 第4名：自选宠物x2
//     • 第5名：自选宠物x1
//     • 第6~10名：许愿币x30
//     • 第11~20名：许愿币x20
//     • 第21~50名：许愿币x10`
// export const rankPkRewardsKf=`【跨服竞技奖励】：
// 一、【每日排名奖励】：每日0点根据积分排名，前50名才有奖励，除了排名奖励，还额外奖励等额积分的钻石(黄金卡有效期内钻石奖励翻倍)
//     • 第1名：大天使宝箱x3
//     • 第2名：大天使宝箱x2
//     • 第3名：大天使宝箱x1
//     • 第4名：许愿币x6
//     • 第5名：许愿币x5
//     • 第6~10名：许愿币x4
//     • 第11~20名：许愿币x3
//     • 第21~50名：许愿币x2
// 二、【赛季额外奖励】：根据上个赛季结束时的积分排名，前50名才有奖励
//     • 第1名：自选宠物x5
//     • 第2名：自选宠物x4
//     • 第3名：自选宠物x3
//     • 第4名：自选宠物x2
//     • 第5名：自选宠物x1
//     • 第6~10名：许愿币x30
//     • 第11~20名：许愿币x20
//     • 第21~50名：许愿币x10`
// export const CjRewordInfoStr=
// `【最快320级奖励】：按最快到达指定等级排名
// 第一名：1000钻石`

// // 藤、革、皮，天蚕、骷髅、青铜，风、魔王、翡翠
// export const baoZhuDefEquips = [
// 	10001, 10002, 10003, 10004, 10005, 10006, 10007, 10008, 10009,
// 	20001, 20002, 20003, 20004, 20005, 20006, 20007, 20008, 20009,
// 	30001, 30002, 30003, 30004, 30005, 30006, 30007, 30008, 30009,
// 	40001, 40002, 40003, 40004, 40005, 40006, 40007, 40008, 40009,
// 	50001, 50002, 50003, 50004, 50005, 50006, 50007, 50008, 50009,
// ]

// // 掉落等级32级以下的武器、盾牌
// export const baoZhuAtkEquips = [
// 	80001, 80002, 80003, 80101, 80102, 80103, 80104, 80105, 80106, 80107, 80108, 100001, 100002, 100003,
// 	80201, 80202, 80203, 80204, 80205, 80206, 80207, 80208, 80209, 80210, 80211, 80212, 80213, 80214, 80215, 80216, 80217, 80218, 80219, 80220, 80221, 80222, 80223,
// 	80501, 80502, 90001, 90002, 90003, 90004, 90005, 90006, 90007, 90008, 90009,
// ]

// // 藤、革、皮，天蚕、骷髅、青铜
// export const goldBox1DefEquips = [
// 	10001, 10002, 10003, 10004, 10005, 10006,
// 	20001, 20002, 20003, 20004, 20005, 20006,
// 	30001, 30002, 30003, 30004, 30005, 30006,
// 	40001, 40002, 40003, 40004, 40005, 40006,
// 	50001, 50002, 50003, 50004, 50005, 50006,
// ]

// // 天蚕 骷髅 青铜 翡翠 风 魔王
// export const goldBox2DefEquips = [
// 	10004, 10005, 10006, 10007, 10008, 10009,
// 	20004, 20005, 20006, 20007, 20008, 20009,
// 	30004, 30005, 30006, 30007, 30008, 30009,
// 	40004, 40005, 40006, 40007, 40008, 40009,
// 	50004, 50005, 50006, 50007, 50008, 50009,
// ]

// // 翡翠 风 魔王 黄金 精灵 白金 飓风
// export const goldBox3DefEquips = [
// 	10007, 10008, 10009, 10010, 10011, 10012, 10042,
// 	20007, 20008, 20009, 20010, 20011, 20012, 20049,
// 	30007, 30008, 30009, 30010, 30011, 30012, 30049,
// 	40007, 40008, 40009, 40010, 40011, 40012, 40049,
// 	50007, 50008, 50009, 50010, 50011, 50012, 50049,
// ]

// // 黄金 精灵 白金 圣元 传说 女神 龙王 飓风 红翼
// export const goldBox4DefEquips = [
// 	10010, 10011, 10012, 10013, 10014, 10015, 10016, 10042, 10043,
// 	20010, 20011, 20012, 20013, 20014, 20015, 20016, 20049, 20050,
// 	30010, 30011, 30012, 30013, 30014, 30015, 30016, 30049, 30050,
// 	40010, 40011, 40012, 40013, 40014, 40015, 40016, 40049, 40050,
// 	50010, 50011, 50012, 50013, 50014, 50015, 50016, 50049, 50050,
// ]

// // 圣元 传说 女神 龙王 圣魂 碧影 暴风 幻月 红翼 远古
// export const goldBox5DefEquips = [
// 	10013, 10014, 10015, 10016, 10017, 10018, 10019, 10020, 10043, 10044,
// 	20013, 20014, 20015, 20016, 20017, 20018, 20019, 20020, 20050, 20051,
// 	30013, 30014, 30015, 30016, 30017, 30018, 30019, 30020, 30050, 30051,
// 	40013, 40014, 40015, 40016, 40017, 40018, 40019, 40020, 40050, 40051,
// 	50013, 50014, 50015, 50016, 50017, 50018, 50019, 50020, 50050, 50051,
// ]

// // 圣魂 碧影 暴风 幻月 远古 火麒麟 黑龙王 圣灵 亚特 神圣 魔灵
// export const goldBox6DefEquips = [
// 	10017, 10018, 10019, 10020, 10021, 10022, 10023, 10024, 10044, 10045,
// 	20017, 20018, 20019, 20020, 20021, 20022, 20023, 20024, 20025, 20051, 20052,
// 	30017, 30018, 30019, 30020, 30021, 30022, 30023, 30024, 30025, 30051, 30052,
// 	40017, 40018, 40019, 40020, 40021, 40022, 40023, 40024, 40025, 40051, 40052,
// 	50017, 50018, 50019, 50020, 20021, 50022, 50023, 50024, 50025, 50051, 50052,
// ]

// // 火麒麟 黑龙王 圣灵 亚特 神圣 魔灵 黑凤凰 红羽 圣光 烈火 奔雷
// export const goldBox7DefEquips = [
// 	10021, 10022, 10023, 10024, 10025, 10026, 10027, 10045,
// 	20021, 20022, 20023, 20024, 20025, 20026, 20027, 20028, 20029, 20030, 20052,
// 	30021, 30022, 30023, 30024, 30025, 30026, 30027, 30028, 30029, 30030, 30052,
// 	40021, 40022, 40023, 40024, 40025, 40026, 40027, 40028, 40029, 40030, 40052,
// 	50021, 50022, 50023, 50024, 50025, 50026, 50027, 50028, 50029, 50030, 50052,
// ]
// // 黑凤凰 红羽 圣光 烈火 奔雷 龙炎 至尊 黑炎 魔神 魔灵
// export const goldBox8DefEquips = [
// 	10025, 10026, 10027, 10028, 10029, 10030, 10045,
// 	20026, 20027, 20028, 20029, 20030, 20031, 20032, 20033, 20034, 20052,
// 	30026, 30027, 30028, 30029, 30030, 30031, 30032, 30033, 30034, 30052,
// 	40026, 40027, 40028, 40029, 40030, 40031, 40032, 40033, 40034, 40052,
// 	50026, 50027, 50028, 50029, 50030, 50031, 50032, 50033, 50034, 50052,
// ]

// // 380
// // 黑凤凰 红羽 圣光 烈火 奔雷 龙炎 至尊 黑炎 魔神 魔灵; 法魂 紫灵 宙斯 暗斗 天魔 风影
// export const goldBox9DefEquips = [
// 	10025, 10026, 10027, 10028, 10029, 10030, 10045, 10031, 10032, 10033, 10034, 10046,
// 	20026, 20027, 20028, 20029, 20030, 20031, 20032, 20033, 20034, 20052, 20035, 20036, 20037, 20038, 20039, 20053,
// 	30026, 30027, 30028, 30029, 30030, 30031, 30032, 30033, 30034, 30052, 30035, 30036, 30037, 30038, 30039, 30053,
// 	40026, 40027, 40028, 40029, 40030, 40031, 40032, 40033, 40034, 40052, 40035, 40036, 40037, 40038, 40039, 40053,
// 	50026, 50027, 50028, 50029, 50030, 50031, 50032, 50033, 50034, 50052, 50035, 50036, 50037, 50038, 50039, 50053,
// ]

// // 400
// // 法魂 紫灵 宙斯 暗斗 天魔 风影; 冥王 泰坦 勇气 恐惧 灵光 霸王 恒翼 巨石 破灭
// export const goldBox10DefEquips = [
// 	10031, 10032, 10033, 10034, 10046, 10035, 10036, 10037, 10038, 10039, 10040, 10041,
// 	20035, 20036, 20037, 20038, 20039, 20053, 20040, 20041, 20042, 20043, 20044, 20045, 20046, 20047, 20048,
// 	30035, 30036, 30037, 30038, 30039, 30053, 30040, 30041, 30042, 30043, 30044, 30045, 30046, 30047, 30048,
// 	40035, 40036, 40037, 40038, 40039, 40053, 40040, 40041, 40042, 40043, 40044, 40045, 40046, 40047, 40048,
// 	50035, 50036, 50037, 50038, 50039, 50053, 50040, 50041, 50042, 50043, 50044, 50045, 50046, 50047, 50048,
// ]

// // 0-16级：
// // 骷髅杖、迷之杖；
// // 短弓、石驽、长弓、黄金石驽、藤箭筒；
// // 短斧 短剑 手斧 波刃剑 石槌 西洋剑 暗杀者 流星槌 双刃矛 双刃斧 战矛 东洋刀
// // 圆盾 钢铁之盾 战士之盾 风之盾 骷髅之盾
// // 火之项链 毒之指环
// export const goldBox1AtkEquips = [
// 	80001, 80501,
// 	80101, 80102, 80103, 80104, 100001,
// 	80201, 80202, 80203, 80204, 80205, 80206, 80207, 80208, 80209, 80210, 80211, 80212,
// 	90001, 90002, 90003, 90004, 90005,
// ]

// // 17-32级：
// // 天使杖、毒蛇杖
// // 精灵长弓 火神弩 巴特之弓 巨人弩 天蚕箭筒 风箭筒
// // 飞翔斧 斧刃矛 拉丁剑 破坏之槌 鹤嘴矛 偃月刀 精灵之斧 双鹤矛 巨蛇魔剑 战士之斧 背叛者
// // 自由之盾 魔法之盾 远古之盾 尖刺之盾
// // 火之项链 雷之项链 毒之指环 冰之指环

// export const goldBox2AtkEquips = [
// 	80002, 80003,
// 	80105, 80106, 80107, 80108, 100002, 100003,
// 	80213, 80214, 80215, 80216, 80217, 80218, 80219, 80220, 80221, 80222, 80223,
// 	90006, 90007, 90008, 90009,
// ]

// // 毒蛇杖 闪电杖 飓风之杖
// // 巴特之弓 巨人弩 黄金虎 诱惑之弩 风箭筒 精灵箭筒
// // 巨蛇魔剑 战士之斧 背叛者 斗士之斧 极光刀 巴迪之矛 白金之槌 天行者 黑武士 传说之剑 巨蛇镰刀 真红之剑 斗神之斧
// // 魔法之盾 远古之盾 尖刺之盾 龙之盾 失落之盾 毒蛇之盾
// // 火之项链 雷之项链 冰之项链 毒之指环 冰之指环 雷之指环
// export const goldBox3AtkEquips = [
// 	80003, 80004, 80502,
// 	80107, 80108, 80109, 80110, 100003, 100004,
// 	80221, 80222, 80223, 80224, 80225, 80226, 80227, 80228, 80229, 80230, 80231, 80232, 80233,
// 	90007, 90008, 90009, 90010, 90011, 90012,
// ]

// // 闪电杖 戈登之杖 传说之杖 战斗权杖 飓风之杖 红翼之杖 火龙兽之书
// // 黄金虎 诱惑之弩 银翼之弓 精灵箭筒 女神箭筒
// // 白金之槌 天行者 黑武士 传说之剑 巨蛇镰刀 真红之剑 斗神之斧 帝王之剑 末日之斧 帝王镰刀 太阳之剑 雷神之剑
// // 龙之盾 失落之盾 毒蛇之盾 传说之盾 布朗司 火龙之盾
// // 火之项链 雷之项链 冰之项链 风之项链 毒之指环 冰之指环 雷之指环 火之指环
// export const goldBox4AtkEquips = [
// 	80004, 80005, 80006, 80401, 80502, 80503, 110001,
// 	80109, 80110, 80111, 100004, 100005,
// 	80227, 80228, 80229, 80230, 80231, 80232, 80233, 80234, 80235, 80236, 80237, 80238,
// 	90010, 90011, 90012, 90013, 90014, 90015,
// ]

// // 传说之杖 复活之杖 战斗权杖 征服权杖 红翼之杖 远古之杖 火龙兽之书 异灵之书
// // 银翼之弓 蓝翎弩 温蒂妮 女神箭筒 碧影箭筒
// // 末日之斧 帝王镰刀 太阳之剑 雷神之剑 死神镰刀 水晶流星 精灵之槌 玄冰剑
// // 毒蛇之盾 传说之盾 布朗司 火龙之盾 精灵之盾 麒麟之盾
// // 火之项链 雷之项链 冰之项链 风之项链 水之项链 毒之指环 冰之指环 雷之指环 火之指环 地之指环
// export const goldBox5AtkEquips = [
// 	80006, 80007, 80401, 80402, 80503, 80504, 110001, 110002,
// 	80111, 80112, 80113, 100005, 100006,
// 	80235, 80236, 80237, 80238, 80239, 80240, 80241, 80242,
// 	90012, 90013, 90014, 90015, 90016, 90017,
// ]

// // 复活之杖 毁灭之杖 征服权杖 圣剑权杖 远古之杖 异灵之书 污灵之书
// // 温蒂妮 圣者之弩 圣灵之弓 碧影箭筒 圣灵箭筒
// // 死神镰刀 水晶流星 精灵之槌 玄冰剑 破坏之剑 青龙刀
// // 火龙之盾 精灵之盾 麒麟之盾
// // 火之项链 雷之项链 冰之项链 风之项链 水之项链 毒之项链 毒之指环 冰之指环 雷之指环 火之指环 地之指环 风之指环
// export const goldBox6AtkEquips = [
// 	80007, 80009, 80402, 80403, 80504, 110002, 110003,
// 	80113, 80115, 80116, 100006, 100007,
// 	80239, 80240, 80241, 80242, 80244, 80245,
// 	90015, 90016, 90017,
// ]

// // 毁灭之杖 麒麟之杖 圣剑权杖 王者权杖 魔灵之杖 污灵之书
// // 圣灵之弓 追月神弩 碧影箭筒 圣灵箭筒
// // 玄冰剑 破坏之剑 青龙刀 屠龙刀 天雷剑 奔雷剑
// // 火龙之盾 精灵之盾 麒麟之盾
// // 火之项链 雷之项链 冰之项链 风之项链 水之项链 毒之项链 地之项链 毒之指环 冰之指环 雷之指环 火之指环 地之指环 风之指环 水之指环
// export const goldBox7AtkEquips = [
// 	80009, 80010, 80403, 80404, 80505, 110003,
// 	80116, 80117, 100006, 100007,
// 	80242, 80244, 80245, 80246, 80301, 80302,
// 	90015, 90016, 90017,
// ]

// // 麒麟之杖 幻月雷杖 王者权杖 圣光权杖 至尊权杖 魔灵之杖 污灵之书
// // 追月神弩 碧影魔弓 红羽神弓 追月箭筒 红羽箭筒
// // 屠龙刀 屠龙刀 暴风锯齿 断月之光 烈火巨刃 魔神剑
// // 火龙之盾 精灵之盾 麒麟之盾
// // 火之项链 雷之项链 冰之项链 风之项链 水之项链 毒之项链 地之项链 毒之指环 冰之指环 雷之指环 火之指环 地之指环 风之指环 水之指环
// export const goldBox8AtkEquips = [
// 	80010, 80012, 80404, 80405, 80406, 80505, 110003,
// 	80117, 80118, 80119, 100008, 100009,
// 	80246, 80247, 80248, 80303, 80304,
// 	90015, 90016, 90017,
// ]

// // 380
// // 麒麟之杖 幻月雷杖 死神之杖 王者权杖 圣光权杖 至尊权杖 圣尊天使权杖 魔灵之杖 风影之杖 污灵之书
// // 追月神弩 碧影魔弓 红羽神弓 紫焰之弓 追月箭筒 红羽箭筒 紫灵箭筒
// // 屠龙刀 屠龙刀 暴风锯齿 断月之光 龙骨巨晶剑 烈火巨刃 魔神剑 傲天魔剑
// // 火龙之盾 精灵之盾 麒麟之盾 十字架之盾
// // 火之项链 雷之项链 冰之项链 风之项链 水之项链 毒之项链 地之项链 毒之指环 冰之指环 雷之指环 火之指环 地之指环 风之指环 水之指环
// export const goldBox9AtkEquips = [
// 	80010, 80012, 80014, 80404, 80405, 80406, 80407, 80505, 80506, 110003,
// 	80117, 80118, 80119, 80120, 100008, 100009, 100010,
// 	80246, 80247, 80248, 80249, 80303, 80304, 80305,
// 	90015, 90016, 90017, 90022,
// ]

// // 400
// // 麒麟之杖 幻月雷杖 死神之杖 魔狱之杖 王者权杖 圣光权杖 至尊权杖 圣尊天使权杖 独裁权杖 魔灵之杖 风影之杖 恒翼之杖 污灵之书 血灵之书
// // 追月神弩 碧影魔弓 红羽神弓 紫焰之弓 神羽之弓 追月箭筒 红羽箭筒 紫灵箭筒 神羽箭筒
// // 屠龙刀 屠龙刀 暴风锯齿 断月之光 龙骨巨晶剑 虚伪之剑 杀戮之剑 烈火巨刃 魔神剑 傲天魔剑 双子之剑
// // 火龙之盾 精灵之盾 麒麟之盾 十字架之盾 亡魂之盾 荣誉之盾 寒冰之盾 火蛇之盾  野望之盾
// // 火之项链 雷之项链 冰之项链 风之项链 水之项链 毒之项链 地之项链 毒之指环 冰之指环 雷之指环 火之指环 地之指环 风之指环 水之指环
// export const goldBox10AtkEquips = [
// 	80010, 80012, 80013, 80014, 80404, 80405, 80406, 80407, 80410, 80505, 80506, 80507, 110003, 110004,
// 	80117, 80118, 80119, 80120, 80121, 100008, 100009, 100010, 100011,
// 	80246, 80247, 80248, 80249, 80250, 80251, 80303, 80304, 80305, 80306,
// 	90015, 90016, 90017, 90018, 90019, 90020, 90021, 90022, 90023,
// ]
// export const ringIds = [60001, 60002, 60003, 60004, 60005, 60006, 60007]
// export const neckIds = [70001, 70002, 70003, 70004, 70005, 70006, 70007]